pierremolinaro/cartes-micro-controleurs-centrale-nantes/carte-h743-lheea/croquis-exemple-stm32duino/STM32H743-configuration-lheea.cpp
//#include "STM32H743-pin-modes.h"
#include "STM32H743-configuration-lheea.h"

//--------------------------------------------------------------------------------------------------
// ATTENTION : il faut straper SB14 et SB15 au dos de la carte Nucleo (voir UM2407)
// https://community.st.com/s/question/0D53W000000YhiISAS/nucleo-h743zi2-pc8-not-connected-to-cn12the-user-manual-for-the-nucleo-h7-devices-says-that-pc8-is-connected-to-connector-8-pin-2-and-connector-12-pin-2-pages-39-and-42-however-on-my-boards-it-doesnt-seem-to-be-connected-to-connector-12-pin-2
// https://community.st.com/s/question/0D53W00000NBaWlSAL/why-are-pc8-and-pc9-not-connected-on-the-morpho-connector-of-my-nucleoh743zi2
//--------------------------------------------------------------------------------------------------
// ATTENTION : il y a un bug dans STM32Duino 1.9.0, qui rend inopérant la lecture de l'entrée analogique sur PA6
// Il faut modifier ~/Library/Arduino15/packages/STM32/hardware/stm32/1.9.0/variants/NUCLEO_H743ZI/PeripheralPins.c
// en décommentant la ligne 57 :
//   {PA_6,  ADC1,  STM_PIN_DATA_EXT(STM_MODE_ANALOG, GPIO_NOPULL, 0, 3, 0)}, // ADC1_INP3
//  https://github.com/stm32duino/Arduino_Core_STM32/issues/1277
//--------------------------------------------------------------------------------------------------
// ATTENTION : il y a un bug dans STM32Duino 1.9.0, qui rend inopérant PG9 en sortie logique
// Il faut modifier ~/Library/Arduino15/packages/STM32/hardware/stm32/1.9.0/variants/NUCLEO_H743ZI/variant.h
// Changer la ligne 174 :
//       #define NUM_DIGITAL_PINS        99
// En
//       #define NUM_DIGITAL_PINS        100
//  https://github.com/stm32duino/Arduino_Core_STM32/issues/1276
//--------------------------------------------------------------------------------------------------

LiquidCrystal lcd (PD6, PD7, PG6, PC0, PD2, PD3) ;

//------------------------------------------------------------------------------
// ALTERNATE FUNCTIONS MODE
//------------------------------------------------------------------------------
// AlternateFunction encoding:
// Bit 15: unused (zero)
// Bits 14-13: 0 -> no pull, 1 -> pullup, 2 -> pulldown
// Bit 12: 0 -> push-pull output, 1 -> open collector output
// Bits 11-4: pin index (PA0 -> 0, PA1 -> 1, ..., PA15 -> 15, PB0 -> 16, ...)
// Bits 3-0: alternate function code (AF0 -> 0, AF1 -> 12, ...)
//------------------------------------------------------------------------------

enum class AlternateFunction : uint16_t {
  PC7_FMC_NE1  = (0 << 13) | (0 << 12) | (39 << 4) | 9,
  PD0_FMC_D2   = (0 << 13) | (0 << 12) | (48 << 4) | 12,
  PD1_FMC_D3   = (0 << 13) | (0 << 12) | (49 << 4) | 12,
  PD4_FMC_NOE  = (0 << 13) | (0 << 12) | (52 << 4) | 12,
  PD5_FMC_NWE  = (0 << 13) | (0 << 12) | (53 << 4) | 12,
  PD11_FMC_A16 = (0 << 13) | (0 << 12) | (59 << 4) | 12,
  PD12_FMC_A17 = (0 << 13) | (0 << 12) | (60 << 4) | 12,
  PD13_FMC_A18 = (0 << 13) | (0 << 12) | (61 << 4) | 12,
  PD14_FMC_D0  = (0 << 13) | (0 << 12) | (62 << 4) | 12,
  PD15_FMC_D1  = (0 << 13) | (0 << 12) | (63 << 4) | 12,
  PE3_FMC_A19  = (0 << 13) | (0 << 12) | (67 << 4) | 12,
  PE4_FMC_A20  = (0 << 13) | (0 << 12) | (68 << 4) | 12,
  PE7_FMC_D4   = (0 << 13) | (0 << 12) | (71 << 4) | 12,
  PE8_FMC_D5   = (0 << 13) | (0 << 12) | (72 << 4) | 12,
  PE9_FMC_D6   = (0 << 13) | (0 << 12) | (73 << 4) | 12,
  PE10_FMC_D7  = (0 << 13) | (0 << 12) | (74 << 4) | 12,
  PF0_FMC_A0   = (0 << 13) | (0 << 12) | (80 << 4) | 12,
  PF1_FMC_A1   = (0 << 13) | (0 << 12) | (81 << 4) | 12,
  PF2_FMC_A2   = (0 << 13) | (0 << 12) | (82 << 4) | 12,
  PF3_FMC_A3   = (0 << 13) | (0 << 12) | (83 << 4) | 12,
  PF4_FMC_A4   = (0 << 13) | (0 << 12) | (84 << 4) | 12,
  PF5_FMC_A5   = (0 << 13) | (0 << 12) | (85 << 4) | 12,
  PF12_FMC_A6  = (0 << 13) | (0 << 12) | (92 << 4) | 12,
  PF13_FMC_A7  = (0 << 13) | (0 << 12) | (93 << 4) | 12,
  PF14_FMC_A8  = (0 << 13) | (0 << 12) | (94 << 4) | 12,
  PF15_FMC_A9  = (0 << 13) | (0 << 12) | (95 << 4) | 12,
  PG0_FMC_A10  = (0 << 13) | (0 << 12) | (96 << 4) | 12,
  PG1_FMC_A11  = (0 << 13) | (0 << 12) | (97 << 4) | 12,
  PG2_FMC_A12  = (0 << 13) | (0 << 12) | (98 << 4) | 12,
  PG3_FMC_A13  = (0 << 13) | (0 << 12) | (99 << 4) | 12,
  PG4_FMC_A14  = (0 << 13) | (0 << 12) | (100 << 4) | 12,
  PG5_FMC_A15  = (0 << 13) | (0 << 12) | (101 << 4) | 12
} ;

//------------------------------------------------------------------------------
// GPIOA BASE ADDRESS
//------------------------------------------------------------------------------

static const uint32_t GPIO_BASE_ADDRESS = 0x58020000 ; // Addresse de GPIOA_MODER

//------------------------------------------------------------------------------

static void setAlternateFunctionMode (const AlternateFunction inPin) {
  const uint32_t pinIndex = (uint32_t (inPin) >> 4) & 0xFF ;
  const uint32_t gpioIndex = pinIndex / 16 ; // 0 -> PORTA, 1 -> PORTB, ...
  const uint32_t portIndex = pinIndex % 16 ; // portIndex: 0, ..., 15
//--- gpioAddress
  const uint32_t gpioAddress = GPIO_BASE_ADDRESS + gpioIndex * 0x400 ;
//--- OPTYPER register has offset 0x04
  const bool openCollector = (uint16_t (inPin) & (1 << 12)) != 0 ;
  volatile uint32_t & OTYPER = *((volatile uint32_t *) (gpioAddress + 0x04)) ;
  uint32_t registerValue = OTYPER ;
  if (openCollector) { // Open collector output
    registerValue |=   (uint32_t (1) << portIndex) ;
  }else{ // Push-pull output
    registerValue &= ~ (uint32_t (1) << portIndex) ;
  }
  OTYPER = registerValue ;
//--- PUPDR register has offset 0x0C
  const uint32_t pupd = uint32_t (inPin) >> 13 ;
  volatile uint32_t & PUPDR = *((volatile uint32_t *) (gpioAddress + 0x0C)) ;
  registerValue = PUPDR ;
  registerValue &= ~ (uint32_t (3) << (portIndex * 2)) ;
  registerValue |=    pupd << (portIndex * 2) ;
  PUPDR = registerValue ;
//--- OSPEEDR register has offset 0x08
  volatile uint32_t & OSPEEDR = *((volatile uint32_t *) (gpioAddress + 0x08)) ;
  const uint32_t speed = 3 ; // Very high speed
  OSPEEDR |= speed << (portIndex * 2) ;
//--- MODER register has offset 0x0
// Alternate : set bit (portIndex * 2 + 1), reset bit (portIndex * 2)
  volatile uint32_t & MODER = *((volatile uint32_t *) (gpioAddress + 0x00)) ;
  registerValue = MODER ;
  registerValue |= uint32_t (1) << ((portIndex * 2) + 1) ;
  registerValue &= ~ (uint32_t (1) << (portIndex * 2)) ;
  MODER = registerValue ;
//--- AFRL register has offset 0x20, AFRH -> 0x24
//--- We use byte access
//    At offset 0 : AFR1[3:0], AFR0[3:0]
//    At offset 1 : AFR3[3:0], AFR2[3:0]
//    At offset 2 : AFR5[3:0], AFR4[3:0]
//    ....
//    At offset 7 : AFR15[3:0], AFR14[3:0]
  const uint8_t alternationFunction = uint8_t (inPin) & 0x0F ;
  const uint32_t AFR_address = gpioAddress + 0x20 + (portIndex / 2) ;
  volatile uint8_t & AFR_BYTE = *((volatile uint8_t *) AFR_address) ;
  const uint8_t mask = ((portIndex & 1) == 0) ? 0xF0 : 0x0F ;
  const uint8_t shiftedAltFunc = ((portIndex & 1) == 0)
    ? alternationFunction
    : (alternationFunction << 4)
  ;
  uint8_t reg = AFR_BYTE ;
  reg &= mask ;
  reg |= shiftedAltFunc ;
  AFR_BYTE = reg ;
}

//--------------------------------------------------------------------------------------------------

