pierremolinaro/cartes-micro-controleurs-centrale-nantes/carte-h743-lheea/croquis-exemple-stm32duino/STM32H743-configuration-lheea.cpp
static void MPU_Config (void) {
  MPU_Region_InitTypeDef MPU_InitStruct ;

  /* Disable the MPU */
  HAL_MPU_Disable();

  /* Configure the MPU as Normal Non Cacheable for the SRAM1 and SRAM2 */
  MPU_InitStruct.Enable = MPU_REGION_ENABLE ;
  MPU_InitStruct.BaseAddress = 0x6000'0000 ; // FMC base
  MPU_InitStruct.Size = MPU_REGION_SIZE_2MB ;
  MPU_InitStruct.AccessPermission = MPU_REGION_FULL_ACCESS ;
  MPU_InitStruct.IsBufferable = MPU_ACCESS_NOT_BUFFERABLE ;
  MPU_InitStruct.IsCacheable = MPU_ACCESS_NOT_CACHEABLE ;
  MPU_InitStruct.IsShareable = MPU_ACCESS_SHAREABLE ;
  MPU_InitStruct.Number = MPU_REGION_NUMBER1 ;
  MPU_InitStruct.TypeExtField = MPU_TEX_LEVEL0 ;
  MPU_InitStruct.SubRegionDisable = 0x00;
  MPU_InitStruct.DisableExec = MPU_INSTRUCTION_ACCESS_ENABLE ;

  HAL_MPU_ConfigRegion (&MPU_InitStruct) ;

  /* Enable the MPU */
  HAL_MPU_Enable (MPU_PRIVILEGED_DEFAULT);
  __DSB () ;
  __ISB () ;
}

// https://community.st.com/s/question/0D50X0000C9hD8DSQU/stm32f746-fmc-configured-for-8bit-parallel-interface-extra-bytes-sent

//------------------------------------------------------------------------------
// Peripheral FMC: FMC
//------------------------------------------------------------------------------

//--- Register BCR1: This register contains the control information of each memory bank, used for SRAMs, PSRAM and NOR Flash memories.
static volatile uint32_t & REG_FMC_BCR1 __attribute__((unused)) = * ((volatile uint32_t *) (0x52004000 + 0)) ;

  // Field MBKEN:  Memory bank enable bit This bit enables the memory bank. After reset Bank1 is enabled, all others are disabled. Accessing a disabled bank causes an ERROR on AXI bus.
  const uint32_t REG_FMC_BCR1_MBKEN = 1U << 0 ;

  // Field WREN:  Write enable bit This bit indicates whether write operations are enabled/disabled in the bank by the FMC:
  const uint32_t REG_FMC_BCR1_WREN = 1U << 12 ;

  // Field WFDIS:  Write FIFO Disable This bit disables the Write FIFO used by the FMC controller. Note: The WFDIS bit of the FMC_BCR2..4 registers is dont care. It is only enabled through the FMC_BCR1 register.
  const uint32_t REG_FMC_BCR1_WFDIS = 1U << 21 ;

  // Field FMCEN:  FMC controller Enable This bit enables/disables the FMC controller. Note: The FMCEN bit of the FMC_BCR2..4 registers is dont care. It is only enabled through the FMC_BCR1 register.
  const uint32_t REG_FMC_BCR1_FMCEN = 1U << 31 ;

//------------------------------------------------------------------------------

//--- Register BTR1: This register contains the control information of each memory bank, used for SRAMs, PSRAM and NOR Flash memories.If the EXTMOD bit is set in the FMC_BCRx register, then this register is partitioned for write and read access, that is, 2 registers are available: one to configure read accesses (this register) and one to configure write accesses (FMC_BWTRx registers).
static volatile uint32_t & REG_FMC_BTR1 __attribute__((unused)) = * ((volatile uint32_t *) (0x52004000 + 4)) ;

  // Field ADDSET:  Address setup phase duration These bits are written by software to define the duration of the address setup phase (refer to Figure81 to Figure93), used in SRAMs, ROMs and asynchronous NOR Flash: For each access mode address setup phase duration, please refer to the respective figure (refer to Figure81 to Figure93). Note: In synchronous accesses, this value is dont care. In Muxed mode or Mode D, the minimum value for ADDSET is 1.
  inline uint32_t REG_FMC_BTR1_ADDSET (const uint32_t inValue) { return (inValue & 0xFU) << 0 ; }

  // Field DATAST:  Data-phase duration These bits are written by software to define the duration of the data phase (refer to Figure81 to Figure93), used in asynchronous accesses: For each memory type and access mode data-phase duration, please refer to the respective figure (Figure81 to Figure93). Example: Mode1, write access, DATAST=1: Data-phase duration= DATAST+1 = 2 KCK_FMC clock cycles. Note: In synchronous accesses, this value is dont care.
  inline uint32_t REG_FMC_BTR1_DATAST (const uint32_t inValue) { return (inValue & 0xFFU) << 8 ; }

  // Field BUSTURN:  Bus turnaround phase duration These bits are written by software to add a delay at the end of a write-to-read or read-to write transaction. The programmed bus turnaround delay is inserted between an asynchronous read (in muxed or mode D) or write transaction and any other asynchronous /synchronous read/write from/to a static bank. If a read operation is performed, the bank can be the same or a different one, whereas it must be different in case of write operation to the bank, except in muxed mode or mode D. In some cases, whatever the programmed BUSTRUN values, the bus turnaround delay is fixed as follows: The bus turnaround delay is not inserted between two consecutive asynchronous write transfers to the same static memory bank except in muxed mode and mode D. There is a bus turnaround delay of 1 FMC clock cycle between: Two consecutive asynchronous read transfers to the same static memory bank except for modes muxed and D. An asynchronous read to an asynchronous or synchronous write to any static bank or dynamic bank except in modes muxed and D mode. There is a bus turnaround delay of 2 FMC clock cycle between: Two consecutive synchronous write operations (in Burst or Single mode) to the same bank. A synchronous write (burst or single) access and an asynchronous write or read transfer to or from static memory bank (the bank can be the same or a different one in case of a read operation. Two consecutive synchronous read operations (in Burst or Single mode) followed by any synchronous/asynchronous read or write from/to another static memory bank. There is a bus turnaround delay of 3 FMC clock cycle between: Two consecutive synchronous write operations (in Burst or Single mode) to different static banks. A synchronous write access (in Burst or Single mode) and a synchronous read from the same or a different bank. The bus turnaround delay allows to match the minimum time between consecutive transactions (tEHEL from NEx high to NEx low) and the maximum time required by the memory to free the data bus after a read access (tEHQZ): (BUSTRUN + 1) KCK_FMC period &#8805; tEHELmin and (BUSTRUN + 2)KCK_FMC period &#8805; tEHQZmax if EXTMOD = 0 (BUSTRUN + 2)KCK_FMC period &#8805; max (tEHELmin, tEHQZmax) if EXTMOD = 126. ...
  inline uint32_t REG_FMC_BTR1_BUSTURN (const uint32_t inValue) { return (inValue & 0xFU) << 16 ; }

//--------------------------------------------------------------------------------------------------

static void configurerAccessRAMExterne (void) {
//--- Activer le module FMC
  RCC->AHB3ENR |= RCC_AHB3ENR_FMCEN ;
  const auto unused1 __attribute__((unused)) = RCC->AHB3ENR ;
 //--- Reset le module FMC
  RCC->AHB3RSTR |= RCC_AHB3RSTR_FMCRST ;
  RCC->AHB3RSTR &= ~ RCC_AHB3RSTR_FMCRST ;
//--- Activer les GPIO
  RCC->AHB4ENR |=
    RCC_AHB4ENR_GPIOAEN |
    RCC_AHB4ENR_GPIOBEN |
    RCC_AHB4ENR_GPIOCEN |
    RCC_AHB4ENR_GPIODEN |
    RCC_AHB4ENR_GPIOEEN |
    RCC_AHB4ENR_GPIOFEN |
    RCC_AHB4ENR_GPIOGEN
  ;
  const auto unused2 __attribute__((unused)) = RCC->AHB4ENR ;
//---
  RCC->D1CCIPR &= ~3 ;
//--- Configurer les ports
  setAlternateFunctionMode (AlternateFunction::PC7_FMC_NE1) ;
  setAlternateFunctionMode (AlternateFunction::PD4_FMC_NOE) ;
  setAlternateFunctionMode (AlternateFunction::PD5_FMC_NWE) ;
  setAlternateFunctionMode (AlternateFunction::PF0_FMC_A0) ;
  setAlternateFunctionMode (AlternateFunction::PF1_FMC_A1) ;
  setAlternateFunctionMode (AlternateFunction::PF2_FMC_A2) ;
  setAlternateFunctionMode (AlternateFunction::PF3_FMC_A3) ;
  setAlternateFunctionMode (AlternateFunction::PF4_FMC_A4) ;
  setAlternateFunctionMode (AlternateFunction::PF5_FMC_A5) ;
  setAlternateFunctionMode (AlternateFunction::PF12_FMC_A6) ;
  setAlternateFunctionMode (AlternateFunction::PF13_FMC_A7) ;
  setAlternateFunctionMode (AlternateFunction::PF14_FMC_A8) ;
  setAlternateFunctionMode (AlternateFunction::PF15_FMC_A9) ;
  setAlternateFunctionMode (AlternateFunction::PG0_FMC_A10) ;
  setAlternateFunctionMode (AlternateFunction::PG1_FMC_A11) ;
  setAlternateFunctionMode (AlternateFunction::PG2_FMC_A12) ;
  setAlternateFunctionMode (AlternateFunction::PG3_FMC_A13) ;
  setAlternateFunctionMode (AlternateFunction::PG4_FMC_A14) ;
  setAlternateFunctionMode (AlternateFunction::PG5_FMC_A15) ;
  setAlternateFunctionMode (AlternateFunction::PD11_FMC_A16) ;
  setAlternateFunctionMode (AlternateFunction::PD12_FMC_A17) ;
  setAlternateFunctionMode (AlternateFunction::PD13_FMC_A18) ;
  setAlternateFunctionMode (AlternateFunction::PE3_FMC_A19) ;
  setAlternateFunctionMode (AlternateFunction::PE4_FMC_A20) ;
  setAlternateFunctionMode (AlternateFunction::PD14_FMC_D0) ;
  setAlternateFunctionMode (AlternateFunction::PD15_FMC_D1) ;
  setAlternateFunctionMode (AlternateFunction::PD0_FMC_D2) ;
  setAlternateFunctionMode (AlternateFunction::PD1_FMC_D3) ;
  setAlternateFunctionMode (AlternateFunction::PE7_FMC_D4) ;
  setAlternateFunctionMode (AlternateFunction::PE8_FMC_D5) ;
  setAlternateFunctionMode (AlternateFunction::PE9_FMC_D6) ;
  setAlternateFunctionMode (AlternateFunction::PE10_FMC_D7) ;
//--- Table 164 page 806 et §21.7.6 page 833
  REG_FMC_BTR1 = REG_FMC_BTR1_BUSTURN (1) | REG_FMC_BTR1_DATAST (10) | REG_FMC_BTR1_ADDSET (7) ;
//--- Table 163, page 805 et §21.7.6 page 829
  REG_FMC_BCR1 = REG_FMC_BCR1_FMCEN // Activer le contrôleur FMC1
    | (1 << 7)
    | REG_FMC_BCR1_WFDIS // Désactiver la FIFO d'écriture
    | REG_FMC_BCR1_WREN // Autoriser les écritures
    | REG_FMC_BCR1_MBKEN // Autoriser les accès
  ;
 // SCB_DisableDCache () ;
  MPU_Config () ;
}

//--------------------------------------------------------------------------------------------------
//   ENCODEUR
//--------------------------------------------------------------------------------------------------

