pierremolinaro/cartes-micro-controleurs-centrale-nantes/carte-h743-lheea/croquis-exemple-stm32duino/STM32H743-configuration-lheea.cpp
static const uint8_t ENCODEUR_A = PC8 ;
static const uint8_t ENCODEUR_B = PC9 ;

//--- La gestion de la valeur de l'encodeur numérique est faite par la routine d'interruption
//    appuiEncodeur, déclenchée sur front descendant du port ENCODEUR_A.
static void appuiEncodeur (void) ;

//--------------------------------------------------------------------------------------------------
//   CONFIGURATION DES PORTS D'ENTRÉES SORTIES
//--------------------------------------------------------------------------------------------------

static void configurerEntreesSortiesLogiques () {
  pinMode (LED_0_VERTE, OUTPUT) ;
  pinMode (LED_1_JAUNE, OUTPUT) ;
  pinMode (LED_2_ROUGE, OUTPUT) ;
  pinMode (NUCLEO_LD1_VERTE, OUTPUT) ;
  pinMode (NUCLEO_LD2_JAUNE, OUTPUT) ;
  pinMode (NUCLEO_LD3_ROUGE, OUTPUT) ;
  pinMode (INTER_DIL_1, INPUT_PULLUP) ;
  pinMode (INTER_DIL_2, INPUT_PULLUP) ;
  pinMode (INTER_DIL_3, INPUT_PULLUP) ;
  pinMode (INTER_DIL_4, INPUT_PULLUP) ;
  pinMode (POUSSOIR_P0_BLANC, INPUT_PULLUP) ;
  pinMode (POUSSOIR_P1_ROSE, INPUT_PULLUP) ;
  pinMode (POUSSOIR_P2_JAUNE, INPUT_PULLUP) ;
  pinMode (POUSSOIR_P3_ROUGE, INPUT_PULLUP) ;
  pinMode (POUSSOIR_NUCLEO_BLEU, INPUT) ;
  pinMode (ENCODEUR_A, INPUT_PULLUP) ;
  pinMode (ENCODEUR_B, INPUT_PULLUP) ;
  pinMode (ENCODEUR_CLIC, INPUT_PULLUP) ;
  attachInterrupt (digitalPinToInterrupt (ENCODEUR_A), appuiEncodeur, FALLING) ;
}

//-------------------------------------------------------------------------------------------------
// ENCODEUR NUMÉRIQUE
//-------------------------------------------------------------------------------------------------

static int32_t gBorneInfEncodeur = 0 ;
static int32_t gBorneSupEncodeur = 0 ;
static int32_t gValeurEncodeur = 0 ;

//-------------------------------------------------------------------------------------------------

void fixerGammeEncodeur (const int32_t inBorneInf, const int32_t inBorneSup) {
  gBorneInfEncodeur = inBorneInf ;
  gBorneSupEncodeur = inBorneSup ;
  if (gValeurEncodeur > gBorneSupEncodeur) {
    gValeurEncodeur = gBorneSupEncodeur ;
  }
  if (gValeurEncodeur < gBorneInfEncodeur) {
    gValeurEncodeur = gBorneInfEncodeur ;
  }
}

//-------------------------------------------------------------------------------------------------

static void appuiEncodeur (void) {
  const bool encodeurB = digitalRead (ENCODEUR_B) ;
  if (!encodeurB && (gValeurEncodeur > gBorneInfEncodeur)) {
    gValeurEncodeur -= 1 ;
  }else if (encodeurB && (gValeurEncodeur < gBorneSupEncodeur)) {
    gValeurEncodeur += 1 ;
  }
}

//-------------------------------------------------------------------------------------------------

int32_t valeurEncodeur (void) {
  return gValeurEncodeur ;
}

//--------------------------------------------------------------------------------------------------
//   SORTIES TOUT-OU-RIEN (TOR)
//--------------------------------------------------------------------------------------------------

static const byte SORTIES_TOR [10] = {
  PE11, // TOR 0
  PE12, // TOR 1
  PE13, // TOR 2
  PE14, // TOR 3
  PE15, // TOR 4
  PF10, // TOR 5
  PG8, // TOR 6
  PG9, // TOR 7
  PG12, // TOR 8
  PG15  // TOR 9
} ;

//--------------------------------------------------------------------------------------------------

static void configurerSortiesTOR (void) {
  for (uint32_t i=0 ; i<10 ; i++) {
    pinMode (SORTIES_TOR [i], OUTPUT) ;
  }
}

//--------------------------------------------------------------------------------------------------

void activerSortieTOR (const uint32_t inIndex, const bool inValue) {
  if (inIndex < 10) {
    digitalWrite (SORTIES_TOR [inIndex], inValue) ;
  }
}

//-------------------------------------------------------------------------------------------------
// SORTIE ANALOGIQUE
// Sortie directe :
//   0 -> 0V
//   255 -> 3,3V
//   inValue -> 3,3V *  inValue / 255
// Sortie amplifiée : dépend du réglage du potentiomètre
//-------------------------------------------------------------------------------------------------

void commanderSortieAnalogique (const uint8_t inValue) {
  analogWrite (PA4, inValue) ;
}

//-------------------------------------------------------------------------------------------------
// ENTRÉES ANALOGIQUES
// Attention, la tension qui parvient au micro-contrôleur est réglage par potentiomètre :
//   0V -> 0
//   3,3V -> 4095
//-------------------------------------------------------------------------------------------------

uint16_t lireEntreeAnalogique (const uint32_t inNumeroEntree) { // 0 ... 3
  uint16_t resultat = 0 ;
  switch (inNumeroEntree) {
  case 0 :
    resultat = adc_read_value (PA_6, 12) ;
    break ;
  case 1 :
    //resultat = analogRead (PB1) ;
    resultat = adc_read_value (PB_1, 12) ;
    break ;
  case 2 :
    // resultat= analogRead (PC3) ;
    resultat = adc_read_value (PC_3, 12) ;
    break ;
  case 3 :
    // resultat = analogRead (PF11) ;
    resultat = adc_read_value (PF_11, 12) ;
    break ;
  default :
    break ;
  }
  return resultat ;
}

//-------------------------------------------------------------------------------------------------
// SPI
//-------------------------------------------------------------------------------------------------
// La configuration du SPI sous stm32duino est TRÈS particulière.
// Voir https://github.com/stm32duino/wiki/wiki/API#spi
//
// Par défaut, pour compatibilité avec Arduino, utiliser le nom SPI configure les signaux MOSI,
// MISO, et SCK de façon à avoir la disposition que l'Arduino nano.
//  #include <SPI.h>
//  ...
//  void setup () {
//    SPI.begin () ;
//    ....
//
// Pour changer les broches par défaut, il faut appeler setMISO, setMOSI, setSCLK, setSSEL, avant
// d'appeler SPI.begin (). C'est ce qui est fait ici. Évidemment, il faut choisir pour les broches
// en fonction de ce que permet le micro-contrôleur.
//
// Si l'on veut des liaisons SPI supplémentaires, il faut créer des nouvelles instances de SPIClass
// avec en arguments MOSI, MISO, SCK et SS :
//  SPIClass mySPI (myMOSI, myMISO, mySCK, mySS) ;
//
// Et c'est là l'approche particulière : alors que la plupart des systèmes de type Arduino
// définissent SPI2, SPI3, … en stm32duino la fonction begin devine le module qui sera
// effectivement utilisé grâce au choix des broches MOSI, MISO, SCK et SS.
//
//-------------------------------------------------------------------------------------------------

static const PinName SPI1_MOSI = PB_5 ;
static const PinName SPI1_MISO = PB_4 ;
static const PinName SPI1_CS   = PG_10 ;
static const PinName SPI1_SCK  = PA_5 ;

