pierremolinaro/cartes-micro-controleurs-centrale-nantes/carte-h743-lheea/croquis-exemple-stm32duino/STM32H743-configuration-lheea.cpp
static const uint8_t SPI2_MOSI = PB15 ;
static const uint8_t SPI2_MISO = PC2 ;
static const uint8_t SPI2_CS   = PB12 ;
static const uint8_t SPI2_SCK  = PB10 ;

static const uint8_t SPI3_MOSI = PC12 ;
static const uint8_t SPI3_MISO = PC11 ;
static const uint8_t SPI3_CS   = PA15 ;
static const uint8_t SPI3_SCK  = PC10 ;

static const uint8_t SPI5_MOSI = PF9 ;
static const uint8_t SPI5_MISO = PF8 ;
static const uint8_t SPI5_CS   = PF6 ;
static const uint8_t SPI5_SCK  = PF7 ;

//-------------------------------------------------------------------------------------------------

static SPIClass mySPI2 (SPI2_MOSI, SPI2_MISO, SPI2_SCK, SPI2_CS) ;
static SPIClass mySPI3 (SPI3_MOSI, SPI3_MISO, SPI3_SCK, SPI3_CS) ;
static SPIClass mySPI5 (SPI5_MOSI, SPI5_MISO, SPI5_SCK, SPI5_CS) ;

//-------------------------------------------------------------------------------------------------

static void configurerSPI (void) {
//--- Configurer SPI1
  SPI.setMOSI (SPI1_MOSI) ;
  SPI.setMISO (SPI1_MISO) ;
  SPI.setSCLK (SPI1_SCK) ;
  SPI.setSSEL (SPI1_CS) ;
  SPI.begin () ;
//--- Configurer SPI2
  mySPI2.begin () ;
//--- Configurer SPI3
  mySPI3.begin () ;
//--- Configurer SPI5
  mySPI5.begin () ;
}

//--------------------------------------------------------------------------------------------------
// EEPROM EXTERNE 
//--------------------------------------------------------------------------------------------------

uint32_t eepromPageSize (const SPI_EEPROM_TYPE inEEPROM) {
  uint32_t result = 0 ;
  switch (inEEPROM) {
  case SPI_EEPROM_TYPE::MCP25LC256 : result = 64 ; break ;
  case SPI_EEPROM_TYPE::MCP25LC512 : result = 128 ; break ;
  }
  return result ;
}

//--------------------------------------------------------------------------------------------------

uint32_t eepromMaxFrequency (const SPI_EEPROM_TYPE inEEPROMType) {
  uint32_t result = 0 ;
  switch (inEEPROMType) {
  case SPI_EEPROM_TYPE::MCP25LC256 : result = 10 * 1000 * 1000 ; break ; // 10 MHz
  case SPI_EEPROM_TYPE::MCP25LC512 : result = 20 * 1000 * 1000 ; break ; // 20 MHz
  }
  return result ;
}

//--------------------------------------------------------------------------------------------------

uint32_t eepromCapacity (const SPI_EEPROM_TYPE inEEPROMType) {
  uint32_t result = 0 ;
  switch (inEEPROMType) {
  case SPI_EEPROM_TYPE::MCP25LC256 : result = 32 * 1024 ; break ; // 32 kio
  case SPI_EEPROM_TYPE::MCP25LC512 : result = 64 * 1024 ; break ; // 64 kio
  }
  return result ;
}

//--------------------------------------------------------------------------------------------------

SPIEEPROM::SPIEEPROM (const MySPI inSPI,
                      const SPI_EEPROM_TYPE inEEPROMType) :
mSPISettings (eepromMaxFrequency (inEEPROMType), MSBFIRST, SPI_MODE0),
mSPI (inSPI),
mEEPROMType (inEEPROMType) {
}

//--------------------------------------------------------------------------------------------------

SPIClass* SPIEEPROM::spiPtr (void) {
  SPIClass * result = nullptr ;
  switch (mSPI) {
  case MySPI::spi1 : result = &SPI ; break ;
  case MySPI::spi2 : result = &mySPI2 ; break ;
  case MySPI::spi3 : result = &mySPI3 ; break ;
  case MySPI::spi5 : result = &mySPI5 ; break ;  
  }
  return result ;
}

//--------------------------------------------------------------------------------------------------

uint32_t SPIEEPROM::eepromPageSize (void) const {
  return ::eepromPageSize (mEEPROMType) ;
}

//--------------------------------------------------------------------------------------------------

uint32_t SPIEEPROM::eepromCapacity (void) const {
  return ::eepromCapacity (mEEPROMType) ;
}

//--------------------------------------------------------------------------------------------------

void SPIEEPROM::begin (void) {
  spiPtr ()->beginTransaction (mSPISettings) ;
}

//--------------------------------------------------------------------------------------------------

 void SPIEEPROM::eepromRead (const uint32_t inAddress,
                             uint8_t outBuffer[],
                             const uint32_t inLength) {
   while (eepromIsBusy ()) {
     delay (1) ;
   }
   uint8_t * localBuffer = new uint8_t [inLength + 3] ;
   localBuffer [0] = 0x03 ; // Read data instruction
   localBuffer [1] = uint8_t (inAddress >> 8) ; // Adresse, poids fort
   localBuffer [2] = uint8_t (inAddress) ; // Adresse, poids faible
   spiPtr ()->transfer (localBuffer, localBuffer, inLength + 3) ; // Les données
   for (uint32_t i=0 ; i<inLength ; i++) {
     outBuffer [i] = localBuffer [i+3] ;
   }
   delete [] localBuffer ;
 }

//--------------------------------------------------------------------------------------------------

uint8_t SPIEEPROM::eepromStatus (void) {
  const uint16_t v = spiPtr ()->transfer16 (0x0500) ; // Read STATUS instruction
  // Serial.print ("Status ") ; Serial.println (uint8_t (v), HEX) ;
  return uint8_t (v) ;
}

//--------------------------------------------------------------------------------------------------

bool SPIEEPROM::eepromIsBusy (void) {
  return (eepromStatus () & 0x01) != 0 ;
}

//--------------------------------------------------------------------------------------------------

void SPIEEPROM::eepromWriteEnable (void) {
  spiPtr ()->transfer (0x06) ; // Write Enable Instruction 
}

//--------------------------------------------------------------------------------------------------

 void SPIEEPROM::eepromWrite (const uint32_t inAddress,
                              const uint8_t inBuffer[],
                              const uint32_t inLength) {

   if (inLength > 0) {
     // Serial.print ("WRITE AT ") ; Serial.print (inAddress, HEX) ; Serial.print (" ") ; Serial.println (inLength) ;
     const uint32_t pageSize = eepromPageSize () ;
     uint32_t address = inAddress ;
     uint32_t length = inLength ;
     uint32_t idx = 0 ;
     while (length > 0) {
       const uint32_t firstPage = address / pageSize ;
       const uint32_t lastPage = (address + length - 1) / pageSize ;
       const uint32_t lg = (firstPage == lastPage) ? length : (pageSize - (address % pageSize)) ;
       // Serial.print ("   ") ; Serial.print (address, HEX) ; Serial.print (" ") ; Serial.println (lg) ;
       while (eepromIsBusy ()) {
         delay (1) ;
       }
       eepromWriteEnable () ;
       uint8_t * localBuffer = new uint8_t [lg + 3] ;
       localBuffer [0] = 0x02 ; // Write data instruction
       localBuffer [1] = uint8_t (address >> 8) ; // Adresse, poids fort
       localBuffer [2] = uint8_t (address) ; // Adresse, poids faible
       for (uint32_t i=0 ; i<lg ; i++) {
         localBuffer [3+i] = inBuffer [idx + i] ;
       }
       spiPtr ()->transfer (localBuffer, localBuffer, lg + 3) ;
       delete [] localBuffer ;
       address += lg ;
       length -= lg ;
       idx += lg ;
     }
   }
 }

//--------------------------------------------------------------------------------------------------
// FLASH EXTERNE 
//--------------------------------------------------------------------------------------------------

uint32_t flashPageSize (const SPI_FLASH_TYPE inFlashType) {
  uint32_t result = 0 ;
  switch (inFlashType) {
  case SPI_FLASH_TYPE::SST26VF064B : result = 256 ; break ;
  case SPI_FLASH_TYPE::IS25LP128   : result = 256 ; break ;
  }
  return result ;
}

//--------------------------------------------------------------------------------------------------

